app/views/users/_form.html.haml

SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  ORDER BY "roles"."id" ASC LIMIT 1  [["user_id", 15]]
---
    .col-md-6
      = f.select :roles, options_for_select([['Cliente', 'customer'], ['Empleado', 'employee'], ['Administrador', 'admin']], (@user.roles.first.name unless @user.new_record?) ), { label: 'Tipo de usuario *'}, {required: 'required'}
    .col-md-6