app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "phone", "address", "active", "contact_name", "contact_email", "contact_phone", "identification", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    set_role
    if @user.save

UPDATE "users" SET "identification" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["identification", "123123"], ["encrypted_password", "$2a$11$LcqmuXZOZV4i5YII4kY6W.CsibyeH0vZxfVq4ku/iP3GlWtnSfIge"], ["updated_at", "2018-05-28 21:32:12.082799"], ["id", 15]]
---
  def update

    set_role
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 14]]
---
  def set_user
    begin
      @user = User.find(params[:id])

SELECT "users".* FROM "users"
---
  def set_filter
    users_scope = User.all